///////////////// task 1 //////////////////////////

let num = +prompt("Введите число");


if (num % 2 === 0 && num > 0) {
alert ("Число чётнoe" )
} else if (num % 2 === 1) {
    alert ("Число нечётнoe")
} else {
    alert ("Число равно нулю")
}


///////////////// task 2 //////////////////////////

let promtVar = prompt( "", NaN);

if (isNaN(promtVar)) {
    alert("Это значение преобразовать в число не получится. Получится NaN");
} else {
    alert("Это значение можно преобразовать в число");
}




